Revit 2027 API
FamilyInstance.Location Property
This property is used to find the physical location of an instance within project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override Location Location { get; }
Public Overrides ReadOnly Property Location As Location
	Get
public:
virtual property Location^ Location {
	Location^ get () override;
}
abstract Location : Location with get
override Location : Location with get
Property Value
Location
Remarks
The Location property returns an object that can be used to find the location of an instance within the project. An instance may have a point location, such as a footing or may have a line location. A beam is an example of an instance that has a line location.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace